{
    "teste": "teste",
    "oii tudo bem?": "olá,sim",
    "quero ajuda": "no que posso ajudar hoje?",
    "em umas perguntas": "tudo bem,vamos lá",
    "qual é o seu nome?": "sou o assistente virtual,pronto para ajudar!",
    "qual ea sua função?": "minha função é ajudar com informações e parefas simples!",
    "voce gosta de musicas?": "eu não tenho emoções,mas posso ajudar você a encontrar músicas boas!",
    "o que é inteligência artificial?": "É a simulação da inteligência humana em máquinas que podem aprender a tomar decisões!",
    "qual é a capital do brasil?": "a capital do brasil é Brasilia!",
    "quem criou você?": "eu fui criado(a) por você,durante o treinamento do chatbot!",
    "qual é o sentido da vida?": "essa é uma pergunta filosófica!talvez seja encontrar propósitos e felicidades",
    "você é real?": "eu sou apenas um progroma de computador,mas estou aqui para ajudar você!",
    "o que é HTML?": "HTML é a linguagem de marcação usada para criar páginas na web!",
    "qual a estrutura básica do HTML?": "A estrutura básica de um documento HTML inclui as tags <html>, <head>, <title>, <body> e outros elementos!",
    "o que faz a tag <div>?": "A tag <div> é usada para agrupar conteúdo e aplicar estilos ou scripts em HTML!",
    "como criar um link em HTML?": "Você pode criar um link usando a tag <a> com o atributo 'href' para definir o destino do link!",
    "o que é a tag <img>?": "A tag <img> é usada para inserir imagens em uma página HTML!",
    "como criar uma lista não ordenada em HTML?": "Para criar uma lista não ordenada, usamos a tag <ul> e as tags <li> para os itens da lista!",
    "o que significa o atributo 'alt' na tag <img>?": "O atributo 'alt' descreve a imagem para leitores de tela e é exibido caso a imagem não carregue!",
    "como criar uma tabela em HTML?": "Para criar uma tabela, usamos as tags <table>, <tr>, <th> e <td> para definir as linhas e colunas!",
    "qual é a função da tag <form>?": "A tag <form> é usada para criar formulários em HTML, permitindo o envio de dados!",
    "o que é a tag <input>?": "A tag <input> é usada para criar campos interativos em formulários, como caixas de texto ou botões!",
    "o que é uma tag semântica em HTML?": "Tags semânticas em HTML como <header>, <footer> e <article> descrevem claramente o conteúdo da página!",
    "como faço para abrir um link em uma nova aba?": "Para abrir um link em uma nova aba, você deve usar o atributo 'target' com o valor '_blank'!",
    "o que é a tag <meta>?": "A tag <meta> fornece metadados sobre a página, como informações de codificação de caracteres ou descrição!",
    "qual é a função do atributo 'href'?": "O atributo 'href' é usado para definir o destino de um link na tag <a>!",
    "o que é a tag <head>?": "A tag <head> contém informações sobre o documento, como título, links para arquivos CSS e metadados!",
    "o que são tags de formatação em HTML?": "Tags de formatação como <b>, <i> e <u> alteram a aparência do texto em uma página HTML!",
    "como definir o título de uma página HTML?": "O título da página é definido dentro da tag <title> que está dentro da tag <head>!",
    "o que é o atributo 'class'?": "O atributo 'class' é usado para atribuir uma classe a um elemento e aplicar estilos via CSS!",
    "o que é o DOCTYPE?": "O DOCTYPE é uma declaração no início do documento HTML que indica qual versão do HTML está sendo usada!",
    "qual é a diferença entre <ul> e <ol>?": "A tag <ul> cria listas não ordenadas, enquanto <ol> cria listas ordenadas com números!",
    "o que é CSS?": "CSS é uma linguagem de estilo usada para definir a aparência de um site, como cores, fontes e layouts!",
    "como se aplica CSS em uma página HTML?": "CSS pode ser aplicado diretamente no HTML através de uma tag <style>, ou então utilizando um arquivo externo com a extensão .css.",
    "qual a diferença entre id e class no CSS?": "O id é único e usado para um único elemento, enquanto a class pode ser aplicada a vários elementos.",
    "o que é o box model no CSS?": "O box model é um modelo que define a estrutura de um elemento HTML, incluindo a margem, borda, preenchimento e conteúdo.",
    "o que são seletores no CSS?": "Seletores são usados para escolher os elementos HTML que você deseja estilizar.",
    "como mudar a cor de fundo de uma página com CSS?": "Você pode usar a propriedade 'background-color' para mudar a cor de fundo de uma página.",
    "o que é uma propriedade no CSS?": "Uma propriedade é uma característica de estilo que pode ser aplicada a um elemento, como 'font-size' ou 'color'.",
    "como centralizar um elemento no CSS?": "Você pode usar 'display: flex' com 'justify-content: center' e 'align-items: center' para centralizar um elemento.",
    "o que é um seletor de atributo em CSS?": "É um seletor que permite estilizar elementos com base em um atributo ou valor específico, como ",
    "como criar um link com CSS?": "Links podem ser estilizados usando o seletor 'a' e suas propriedades como 'color', 'text-decoration', entre outras.",
    "o que é o flexbox no CSS?": "Flexbox é um modelo de layout do CSS que permite criar layouts flexíveis e responsivos de maneira simples.",
    "o que é a propriedade 'position' no CSS?": "A propriedade 'position' define como um elemento é posicionado na página, com valores como 'relative', 'absolute', 'fixed' ou 'sticky'.",
    "como criar uma animação no CSS?": "Você pode usar a propriedade 'animation' com regras como 'keyframes' para criar animações no CSS.",
    "o que são media queries no CSS?": "Media queries são usadas para aplicar estilos diferentes dependendo das características do dispositivo, como tamanho da tela.",
    "o que é o 'z-index' no CSS?": "O 'z-index' controla a ordem de empilhamento dos elementos, permitindo que um elemento sobreponha o outro.",
    "como aplicar uma borda redonda a um elemento com CSS?": "A propriedade 'border-radius' é usada para aplicar bordas arredondadas aos elementos.",
    "qual a diferença entre 'padding' e 'margin' no CSS?": "'Padding' é o espaço interno entre o conteúdo e a borda do elemento, enquanto 'margin' é o espaço externo entre o elemento e outros elementos.",
    "o que é a propriedade 'display' no CSS?": "A propriedade 'display' controla como um elemento é exibido na página, como 'block', 'inline' ou 'flex'.",
    "como alterar a fonte de um texto com CSS?": "Você pode usar a propriedade 'font-family' para definir a fonte de um texto em CSS.",
    "como esconder um elemento com CSS?": "Você pode usar a propriedade 'display' none' ou 'visibility: hidden' para esconder um elemento da página.",
    "o que é Python?": "Python é uma linguagem de programação de alto nível, amplamente usada para desenvolvimento web, automação, análise de dados e inteligência artificial.",
    "como instalar o Python?": "Você pode baixar e instalar o Python no site oficial python.org, e também pode usar gerenciadores de pacotes como 'brew' no macOS ou 'apt' no Linux.",
    "o que é um interpretador Python?": "O interpretador Python é um programa que executa o código Python diretamente, sem a necessidade de compilar o código antes.",
    "o que são variáveis em Python?": "Variáveis em Python são espaços na memória onde podemos armazenar dados. Elas não exigem declaração de tipo antes de serem usadas.",
    "qual a diferença entre listas e tuplas em Python?": "Listas são mutáveis, ou seja, seus elementos podem ser alterados, enquanto tuplas são imutáveis, ou seja, seus elementos não podem ser modificados após a criação.",
    "como criar uma função em Python?": "Você pode criar uma função em Python usando a palavra-chave 'def', seguida do nome da função e seus parâmetros entre parênteses.",
    "o que são dicionários em Python?": "Dicionários em Python são coleções de pares chave-valor, permitindo o armazenamento de dados associados a uma chave única.",
    "como fazer um loop em Python?": "Você pode usar a estrutura 'for' para iterar sobre uma sequência de dados, ou 'while' para repetir uma ação enquanto uma condição for verdadeira.",
    "o que é uma condição if em Python?": "A estrutura 'if' permite executar um bloco de código se uma condição especificada for verdadeira, podendo ser seguida por 'else' ou 'elif'.",
    "como manipular strings em Python?": "Você pode manipular strings em Python utilizando métodos como .upper(), .lower(), .replace(), .split(), entre outros.",
    "o que são módulos em Python?": "Módulos em Python são arquivos que contêm código reutilizável, podendo ser importados para outros programas usando a palavra-chave 'import'.",
    "o que são listas em Python?": "Listas são estruturas de dados em Python que podem armazenar múltiplos valores, que podem ser de tipos diferentes e são indexados.",
    "o que é uma exceção em Python?": "Exceções são erros que ocorrem durante a execução de um programa. Elas podem ser tratadas usando blocos 'try' e 'except'.",
    "o que é a biblioteca pandas em Python?": "Pandas é uma biblioteca de Python usada para manipulação e análise de dados, especialmente para dados em formato tabular como planilhas.",
    "como instalar pacotes em Python?": "Você pode instalar pacotes em Python utilizando o 'pip', um gerenciador de pacotes, com o comando 'pip install nome_do_pacote'.",
    "o que é uma classe em Python?": "Uma classe em Python é um modelo ou blueprint para criar objetos (instâncias), definindo atributos e métodos.",
    "o que é herança em Python?": "Herança é um conceito da programação orientada a objetos em Python, onde uma classe pode herdar atributos e métodos de outra classe.",
    "como criar um arquivo em Python?": "Você pode criar e escrever em arquivos em Python utilizando a função 'open()', com o modo 'w' para escrever e 'r' para ler.",
    "o que são argumentos e parâmetros em Python?": "Argumentos são valores passados para uma função quando ela é chamada, e parâmetros são as variáveis que recebem esses valores na definição da função.",
    "o que é o Python Shell?": "O Python Shell é um ambiente interativo que permite executar comandos Python linha por linha, ideal para testes rápidos e aprendizado.",
    "o que é JavaScript?": "JavaScript é uma linguagem de programação usada principalmente para criar interatividade em sites.",
    "qual é a principal função do JavaScript?": "A principal função do JavaScript é tornar páginas web interativas e dinâmicas.",
    "o que é uma variável em JavaScript?": "Uma variável é um espaço de armazenamento para dados, podendo ser alterado durante a execução do programa.",
    "como declarar uma variável em JavaScript?": "Você pode declarar uma variável usando as palavras-chave var, let ou const.",
    "o que é uma função em JavaScript?": "Uma função é um bloco de código projetado para executar uma tarefa específica.",
    "o que é um array em JavaScript?": "Um array é uma lista ordenada de valores que pode armazenar múltiplos itens.",
    "como criar um array em JavaScript?": "Você pode criar um array usando colchetes, como em: let meuArray = [1, 2, 3];",
    "o que é um objeto em JavaScript?": "Um objeto é uma coleção de propriedades, onde cada propriedade tem um valor associado.",
    "como criar um objeto em JavaScript?": "Você pode criar um objeto usando chaves, como em: let meuObjeto = {nome: 'João', idade: 30};",
    "o que significa 'undefined' em JavaScript?": "'Undefined' é um valor primitivo que indica que uma variável foi declarada, mas ainda não foi atribuída a nenhum valor.",
    "o que é o 'null' em JavaScript?": "'Null' é um valor especial que indica a ausência intencional de valor ou objeto.",
    "o que são os operadores aritméticos em JavaScript?": "Os operadores aritméticos realizam operações matemáticas, como +, -, *, / e %. ",
    "como funciona a estrutura de controle 'if' em JavaScript?": "O 'if' é usado para executar um bloco de código se uma condição for verdadeira.",
    "o que é um loop 'for' em JavaScript?": "O loop 'for' permite repetir um bloco de código um número específico de vezes.",
    "qual é a diferença entre '==' e '===' em JavaScript?": "'==' compara apenas os valores, enquanto '===' compara os valores e os tipos de dados.",
    "o que é o 'console.log()' em JavaScript?": "'console.log()' é usado para exibir mensagens ou valores no console do navegador.",
    "como manipular o DOM com JavaScript?": "Você pode manipular o DOM usando métodos como document.getElementById() ou document.querySelector().",
    "o que é o evento 'click' em JavaScript?": "O evento 'click' ocorre quando um elemento é clicado pelo usuário.",
    "o que é 'hoisting' em JavaScript?": "Hoisting é um comportamento do JavaScript onde declarações de variáveis e funções são movidas para o topo do código antes da execução.",
    "o que é 'promise' em JavaScript?": "Uma promise é um objeto que representa a eventual conclusão ou falha de uma operação assíncrona.",
    "o que é uma calculadora básica?": "Uma calculadora básica é um dispositivo ou aplicativo que realiza operações matemáticas simples, como adição, subtração, multiplicação e divisão.",
    "como somar dois números?": "Para somar dois números, você usa o operador '+', como em 5 + 3.",
    "como subtrair dois números?": "Para subtrair dois números, você usa o operador '-', como em 10 - 4.",
    "como multiplicar dois números?": "Para multiplicar dois números, você usa o operador '*', como em 6 * 7.",
    "como dividir dois números?": "Para dividir dois números, você usa o operador '/', como em 20 / 4.",
    "qual é o resultado de 5 + 3?": "O resultado de 5 + 3 é 8.",
    "qual é o resultado de 9 - 4?": "O resultado de 9 - 4 é 5.",
    "qual é o resultado de 6 * 7?": "O resultado de 6 * 7 é 42.",
    "qual é o resultado de 20 / 5?": "O resultado de 20 / 5 é 4.",
    "o que acontece quando você divide por zero?": "Dividir por zero resulta em um erro ou é matematicamente indefinido.",
    "como calcular a média de números?": "A média de números é calculada somando todos os números e dividindo pelo número total de itens.",
    "o que é um número negativo?": "Um número negativo é um número que é menor que zero, como -3 ou -10.",
    "como somar números negativos?": "Para somar números negativos, você simplesmente adiciona os valores e coloca o sinal negativo, como -5 + (-3).",
    "como subtrair números negativos?": "Para subtrair números negativos, você adiciona o valor absoluto, como -5 - (-3) que resulta em -2.",
    "como multiplicar números negativos?": "Multiplicar dois números negativos resulta em um número positivo, como -2 * -3 = 6.",
    "como dividir números negativos?": "Dividir dois números negativos também resulta em um número positivo, como -10 / -2 = 5.",
    "como calcular um percentual?": "Para calcular um percentual, multiplique o valor pelo percentual e depois divida por 100, como em (20 * 10) / 100.",
    "como calcular a raiz quadrada de um número?": "A raiz quadrada de um número pode ser calculada usando uma função específica ou uma calculadora científica, como √16 = 4.",
    "como calcular o quadrado de um número?": "Para calcular o quadrado de um número, você multiplica o número por ele mesmo, como 4 * 4 = 16.",
    "o que é o operador módulo?": "O operador módulo (%) retorna o resto da divisão entre dois números, como em 10 % 3, que resulta em 1.",
    "como fazer uma divisão com resultado decimal?": "Se o dividendo não for múltiplo do divisor, o resultado será um número decimal, como 7 / 3 = 2.333.",
    "qual é o resultado de 0 * 5?": "O resultado de 0 * 5 é 0.",
    "como arredondar um número?": "Para arredondar um número, você pode usar a função de arredondamento, como em 3.6 arredondado para 4.",
    "como calcular a área de um círculo?": "A área de um círculo é calculada usando a fórmula A = π * raio².",
    "qual é a fórmula para calcular a área de um retângulo?": "A área de um retângulo é calculada com a fórmula A = largura * altura.",
    "como calcular o fatorial de um número?": "O fatorial de um número é o produto de todos os números inteiros de 1 até esse número, como 5! = 5 * 4 * 3 * 2 * 1 = 120.",
    "o que é uma operação de adição com números decimais?": "Adicionar números decimais é feito da mesma forma que números inteiros, alinhando a vírgula, como 2.5 + 3.7 = 6.2.",
    "como dividir números decimais?": "A divisão de números decimais segue a mesma regra que a divisão de inteiros, como 4.5 / 1.5 = 3.",
    "como calcular o valor absoluto de um número?": "O valor absoluto de um número é o número sem o sinal negativo, como | -5 | = 5.",
  "como resolver uma equação simples?": "Uma equação simples pode ser resolvida isolando a variável, como em 2x + 3 = 7, onde x = 2.",
  "qual é o resultado de 5 / 0?": "Dividir por zero não é permitido e resulta em erro.",
  "como fazer um cálculo de área de um triângulo?": "A área de um triângulo é calculada com a fórmula A = (base * altura) / 2.",
  "qual é a diferença entre uma calculadora básica e científica?": "Uma calculadora científica oferece funções adicionais, como cálculos trigonométricos e exponenciais, enquanto a básica realiza apenas operações simples.",
  "como calcular o valor de 10 elevado a 2?": "O valor de 10 elevado a 2 é 100, já que 10² = 10 * 10.",
  "como fazer uma operação de multiplicação com números decimais?": "Multiplicar números decimais é feito normalmente, como 2.5 * 4.2 = 10.5.",
  "como fazer uma operação de subtração com números decimais?": "Para subtrair números decimais, alinhe a vírgula e faça a operação, como 5.6 - 2.3 = 3.3.",
  "como calcular o tempo de uma operação matemática?": "Em uma calculadora, o tempo de execução é geralmente muito rápido, mas em programação você pode medir usando funções de tempo.",
  "como criar uma calculadora em JavaScript?": "Você pode criar uma calculadora simples em JavaScript usando funções para cada operação matemática e um sistema de interface com o usuário.",
  "qual é o resultado de 0 + 0?": "O resultado de 0 + 0 é 0.",
  "como fazer uma operação de multiplicação com zero?": "Qualquer número multiplicado por zero resulta em zero, como 0 * 5 = 0."
}       
